tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1527_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1527_H_
#define _PIC16LF1527_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define PORTC                         53
#define RC0                           54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTD                         62
#define RD0                           63
#define RD1                           64
#define RD2                           65
#define RD3                           66
#define RD4                           67
#define RD5                           68
#define RD6                           69
#define RD7                           70
#define PORTE                         71
#define RE0                           72
#define RE1                           73
#define RE2                           74
#define RE3                           75
#define RE4                           76
#define RE5                           77
#define RE6                           78
#define RE7                           79
#define PIR1                          80
#define TMR1IF                        81
#define TMR2IF                        82
#define CCP1IF                        83
#define SSPIF                         84
#define SSP1IF                        85
#define TXIF                          86
#define TX1IF                         87
#define RCIF                          88
#define RC1IF                         89
#define ADIF                          90
#define TMR1GIF                       91
#define PIR2                          92
#define CCP2IF                        93
#define TMR8IF                        94
#define TMR10IF                       95
#define BCLIF                         96
#define BCL1IF                        97
#define TMR3GIF                       98
#define TMR5GIF                       99
#define OSFIF                         100
#define PIR3                          101
#define TMR3IF                        102
#define TMR4IF                        103
#define TMR5IF                        104
#define TMR6IF                        105
#define CCP3IF                        106
#define CCP4IF                        107
#define CCP5IF                        108
#define CCP6IF                        109
#define PIR4                          110
#define SSP2IF                        111
#define BCL2IF                        112
#define CCP7IF                        113
#define CCP8IF                        114
#define TX2IF                         115
#define RC2IF                         116
#define CCP9IF                        117
#define CCP10IF                       118
#define TMR0                          119
#define TMR1L                         120
#define TMR1H                         121
#define T1CON                         122
#define TMR1ON                        123
#define nT1SYNC                       124
#define T1OSCEN                       125
#define T1CON_SOSCEN                  126
#define T1CKPS0                       127
#define T1CKPS                        128
#define T1CKPS1                       129
#define TMR1CS0                       130
#define TMR1CS                        131
#define TMR1CS1                       132
#define T1GCON                        133
#define T1GSS0                        134
#define T1GSS                         135
#define T1GSS1                        136
#define T1GVAL                        137
#define T1GGO_nDONE                   138
#define T1GSPM                        139
#define T1GTM                         140
#define T1GPOL                        141
#define TMR1GE                        142
#define TMR2                          143
#define PR2                           144
#define T2CON                         145
#define T2CKPS0                       146
#define T2CKPS                        147
#define T2CKPS1                       148
#define TMR2ON                        149
#define T2OUTPS0                      150
#define T2OUTPS                       151
#define T2OUTPS1                      152
#define T2OUTPS2                      153
#define T2OUTPS3                      154
#define TRISA                         155
#define TRISA0                        156
#define TRISA1                        157
#define TRISA2                        158
#define TRISA3                        159
#define TRISA4                        160
#define TRISA5                        161
#define TRISA6                        162
#define TRISA7                        163
#define TRISB                         164
#define TRISB0                        165
#define TRISB1                        166
#define TRISB2                        167
#define TRISB3                        168
#define TRISB4                        169
#define TRISB5                        170
#define TRISB6                        171
#define TRISB7                        172
#define TRISC                         173
#define TRISC0                        174
#define TRISC1                        175
#define TRISC2                        176
#define TRISC3                        177
#define TRISC4                        178
#define TRISC5                        179
#define TRISC6                        180
#define TRISC7                        181
#define TRISD                         182
#define TRISD0                        183
#define TRISD1                        184
#define TRISD2                        185
#define TRISD3                        186
#define TRISD4                        187
#define TRISD5                        188
#define TRISD6                        189
#define TRISD7                        190
#define TRISE                         191
#define TRISE0                        192
#define TRISE1                        193
#define TRISE2                        194
#define TRISE3                        195
#define TRISE4                        196
#define TRISE5                        197
#define TRISE6                        198
#define TRISE7                        199
#define PIE1                          200
#define TMR1IE                        201
#define TMR2IE                        202
#define CCP1IE                        203
#define SSP1IE                        204
#define SSPIE                         205
#define TXIE                          206
#define TX1IE                         207
#define RC1IE                         208
#define RCIE                          209
#define ADIE                          210
#define TMR1GIE                       211
#define PIE2                          212
#define CCP2IE                        213
#define TMR8IE                        214
#define TMR10IE                       215
#define BCL1IE                        216
#define BCLIE                         217
#define TMR3GIE                       218
#define TMR5GIE                       219
#define OSFIE                         220
#define PIE3                          221
#define TMR3IE                        222
#define TMR4IE                        223
#define TMR5IE                        224
#define TMR6IE                        225
#define CCP3IE                        226
#define CCP4IE                        227
#define CCP5IE                        228
#define CCP6IE                        229
#define PIE4                          230
#define SSP2IE                        231
#define BCL2IE                        232
#define CCP7IE                        233
#define CCP8IE                        234
#define TX2IE                         235
#define RC2IE                         236
#define CCP9IE                        237
#define CCP10IE                       238
#define OPTION_REG                    239
#define PS                            240
#define PS0                           241
#define PS1                           242
#define PS2                           243
#define PSA                           244
#define T0SE                          245
#define TMR0SE                        246
#define T0CS                          247
#define TMR0CS                        248
#define INTEDG                        249
#define nWPUEN                        250
#define PCON                          251
#define nBOR                          252
#define nPOR                          253
#define nRI                           254
#define nRMCLR                        255
#define nRWDT                         256
#define STKUNF                        257
#define STKOVF                        258
#define WDTCON                        259
#define SWDTEN                        260
#define WDTPS                         261
#define WDTPS0                        262
#define WDTPS1                        263
#define WDTPS2                        264
#define WDTPS3                        265
#define WDTPS4                        266
#define OSCCON                        267
#define SCS0                          268
#define SCS                           269
#define SCS1                          270
#define IRCF                          271
#define IRCF0                         272
#define IRCF1                         273
#define IRCF2                         274
#define IRCF3                         275
#define OSCSTAT                       276
#define HFIOFS                        277
#define LFIOFR                        278
#define HFIOFR                        279
#define OSTS                          280
#define SOSCR                         281
#define T1OSCR                        282
#define ADRESL                        283
#define ADRESH                        284
#define ADCON0                        285
#define ADON                          286
#define GO_nDONE                      287
#define GO                            288
#define ADGO                          289
#define CHS0                          290
#define CHS                           291
#define CHS1                          292
#define CHS2                          293
#define CHS3                          294
#define CHS4                          295
#define ADCON1                        296
#define ADPREF0                       297
#define ADPREF                        298
#define ADPREF1                       299
#define ADCS0                         300
#define ADCS                          301
#define ADCS1                         302
#define ADCS2                         303
#define ADFM                          304
#define LATA                          305
#define LATA0                         306
#define LATA1                         307
#define LATA2                         308
#define LATA3                         309
#define LATA4                         310
#define LATA5                         311
#define LATA6                         312
#define LATA7                         313
#define LATB                          314
#define LATB0                         315
#define LATB1                         316
#define LATB2                         317
#define LATB3                         318
#define LATB4                         319
#define LATB5                         320
#define LATB6                         321
#define LATB7                         322
#define LATC                          323
#define LATC0                         324
#define LATC1                         325
#define LATC2                         326
#define LATC3                         327
#define LATC4                         328
#define LATC5                         329
#define LATC6                         330
#define LATC7                         331
#define LATD0                         332
#define LATD                          333
#define LATD1                         334
#define LATD2                         335
#define LATD3                         336
#define LATD4                         337
#define LATD5                         338
#define LATD6                         339
#define LATD7                         340
#define LATE                          341
#define LATE0                         342
#define LATE1                         343
#define LATE2                         344
#define LATE3                         345
#define LATE4                         346
#define LATE5                         347
#define LATE6                         348
#define LATE7                         349
#define BORCON                        350
#define BORRDY                        351
#define BORFS                         352
#define SBOREN                        353
#define FVRCON                        354
#define ADFVR0                        355
#define ADFVR                         356
#define ADFVR1                        357
#define TSRNG                         358
#define TSEN                          359
#define FVRRDY                        360
#define FVREN                         361
#define APFCON                        362
#define CCP2SEL                       363
#define T3CKISEL                      364
#define ANSA0                         365
#define ANSELA                        366
#define ANSA1                         367
#define ANSA2                         368
#define ANSA3                         369
#define ANSA5                         370
#define ANSB0                         371
#define ANSELB                        372
#define ANSB1                         373
#define ANSB2                         374
#define ANSB3                         375
#define ANSB4                         376
#define ANSB5                         377
#define ANSELD                        378
#define ANSD0                         379
#define ANSD1                         380
#define ANSD2                         381
#define ANSD3                         382
#define ANSELE                        383
#define ANSE0                         384
#define ANSE1                         385
#define ANSE2                         386
#define PMADRL                        387
#define PMADRH                        388
#define PMDATL                        389
#define PMDATH                        390
#define PMCON1                        391
#define RD                            392
#define WR                            393
#define WREN                          394
#define WRERR                         395
#define FREE                          396
#define LWLO                          397
#define CFGS                          398
#define PMCON2                        399
#define RC1REG                        400
#define TX1REG                        401
#define SP1BRGL                       402
#define SP1BRGH                       403
#define RC1STA                        404
#define RC1STA_RX9D                   405
#define RC1STA_OERR                   406
#define RC1STA_FERR                   407
#define RC1STA_ADDEN                  408
#define RC1STA_CREN                   409
#define RC1STA_SREN                   410
#define RC1STA_RX9                    411
#define RC1STA_SPEN                   412
#define TX1STA                        413
#define TX1STA_TX9D                   414
#define TX1STA_TRMT                   415
#define TX1STA_BRGH                   416
#define TX1STA_SENDB                  417
#define TX1STA_SYNC                   418
#define TX1STA_TXEN                   419
#define TX1STA_TX9                    420
#define TX1STA_CSRC                   421
#define BAUD1CON                      422
#define BAUD1CON_ABDEN                423
#define BAUD1CON_WUE                  424
#define BAUD1CON_BRG16                425
#define BAUD1CON_SCKP                 426
#define BAUD1CON_RCIDL                427
#define BAUD1CON_ABDOVF               428
#define WPUB0                         429
#define WPUB                          430
#define WPUB1                         431
#define WPUB2                         432
#define WPUB3                         433
#define WPUB4                         434
#define WPUB5                         435
#define WPUB6                         436
#define WPUB7                         437
#define WPUD                          438
#define WPUD0                         439
#define WPUD1                         440
#define WPUD2                         441
#define WPUD3                         442
#define WPUD4                         443
#define WPUD5                         444
#define WPUD6                         445
#define WPUD7                         446
#define WPUE                          447
#define WPUE0                         448
#define WPUE1                         449
#define WPUE2                         450
#define WPUE3                         451
#define WPUE4                         452
#define WPUE5                         453
#define WPUE6                         454
#define WPUE7                         455
#define SSP1BUF                       456
#define SSP1BUF_SSPBUF                457
#define SSP1ADD                       458
#define SSP1ADD_SSPADD                459
#define SSP1MSK                       460
#define SSP1MSK_SSPMSK                461
#define SSP1STAT                      462
#define SSP1STAT_BF                   463
#define SSP1STAT_UA                   464
#define SSP1STAT_R_nW                 465
#define SSP1STAT_S                    466
#define SSP1STAT_P                    467
#define SSP1STAT_D_nA                 468
#define SSP1STAT_CKE                  469
#define SSP1STAT_SMP                  470
#define SSP1CON1                      471
#define SSP1CON1_SSPM                 472
#define SSP1CON1_SSPM0                473
#define SSP1CON1_SSPM1                474
#define SSP1CON1_SSPM2                475
#define SSP1CON1_SSPM3                476
#define SSP1CON1_CKP                  477
#define SSP1CON1_SSPEN                478
#define SSP1CON1_SSPOV                479
#define SSP1CON1_WCOL                 480
#define SSP1CON2                      481
#define SSP1CON2_SEN                  482
#define SSP1CON2_RSEN                 483
#define SSP1CON2_PEN                  484
#define SSP1CON2_RCEN                 485
#define SSP1CON2_ACKEN                486
#define SSP1CON2_ACKDT                487
#define SSP1CON2_ACKSTAT              488
#define SSP1CON2_GCEN                 489
#define SSP1CON3                      490
#define SSP1CON3_DHEN                 491
#define SSP1CON3_AHEN                 492
#define SSP1CON3_SBCDE                493
#define SSP1CON3_SDAHT                494
#define SSP1CON3_BOEN                 495
#define SSP1CON3_SCIE                 496
#define SSP1CON3_PCIE                 497
#define SSP1CON3_ACKTIM               498
#define SSP2BUF                       499
#define SSP2BUF_SSPBUF                500
#define SSP2ADD                       501
#define SSP2ADD_SSPADD                502
#define SSP2MSK                       503
#define SSP2MSK_SSPMSK                504
#define SSP2STAT                      505
#define SSP2STAT_BF                   506
#define SSP2STAT_UA                   507
#define SSP2STAT_R_nW                 508
#define SSP2STAT_S                    509
#define SSP2STAT_P                    510
#define SSP2STAT_D_nA                 511
#define SSP2STAT_CKE                  512
#define SSP2STAT_SMP                  513
#define SSP2CON1                      514
#define SSP2CON1_SSPM                 515
#define SSP2CON1_SSPM0                516
#define SSP2CON1_SSPM1                517
#define SSP2CON1_SSPM2                518
#define SSP2CON1_SSPM3                519
#define SSP2CON1_CKP                  520
#define SSP2CON1_SSPEN                521
