tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1527_tdd.h
#define SSP2CON1_SSPOV                522
#define SSP2CON1_WCOL                 523
#define SSP2CON2                      524
#define SSP2CON2_SEN                  525
#define SSP2CON2_RSEN                 526
#define SSP2CON2_PEN                  527
#define SSP2CON2_RCEN                 528
#define SSP2CON2_ACKEN                529
#define SSP2CON2_ACKDT                530
#define SSP2CON2_ACKSTAT              531
#define SSP2CON2_GCEN                 532
#define SSP2CON3                      533
#define SSP2CON3_DHEN                 534
#define SSP2CON3_AHEN                 535
#define SSP2CON3_SBCDE                536
#define SSP2CON3_SDAHT                537
#define SSP2CON3_BOEN                 538
#define SSP2CON3_SCIE                 539
#define SSP2CON3_PCIE                 540
#define SSP2CON3_ACKTIM               541
#define PORTF                         542
#define RF0                           543
#define RF1                           544
#define RF2                           545
#define RF3                           546
#define RF4                           547
#define RF5                           548
#define RF6                           549
#define RF7                           550
#define PORTG                         551
#define RG0                           552
#define RG1                           553
#define RG2                           554
#define RG3                           555
#define RG4                           556
#define RG5                           557
#define CCPR1L                        558
#define CCPR1H                        559
#define CCP1CON                       560
#define CCP1M0                        561
#define CCP1M                         562
#define CCP1M1                        563
#define CCP1M2                        564
#define CCP1M3                        565
#define DC1B                          566
#define DC1B0                         567
#define DC1B1                         568
#define CCPR2L                        569
#define CCPR2H                        570
#define CCP2CON                       571
#define CCP2M                         572
#define CCP2M0                        573
#define CCP2M1                        574
#define CCP2M2                        575
#define CCP2M3                        576
#define DC2B0                         577
#define DC2B                          578
#define DC2B1                         579
#define CCPTMRS0                      580
#define C1TSEL0                       581
#define C1TSEL                        582
#define C1TSEL1                       583
#define C2TSEL0                       584
#define C2TSEL                        585
#define C2TSEL1                       586
#define C3TSEL0                       587
#define C3TSEL                        588
#define C3TSEL1                       589
#define C4TSEL                        590
#define C4TSEL0                       591
#define C4TSEL1                       592
#define CCPTMRS1                      593
#define C5TSEL                        594
#define C5TSEL0                       595
#define C5TSEL1                       596
#define C6TSEL0                       597
#define C6TSEL                        598
#define C6TSEL1                       599
#define C7TSEL                        600
#define C7TSEL0                       601
#define C7TSEL1                       602
#define C8TSEL0                       603
#define C8TSEL                        604
#define C8TSEL1                       605
#define CCPTMRS2                      606
#define C9TSEL                        607
#define C9TSEL0                       608
#define C9TSEL1                       609
#define C10TSEL0                      610
#define C10TSEL                       611
#define C10TSEL1                      612
#define TRISF                         613
#define TRISF0                        614
#define TRISF1                        615
#define TRISF2                        616
#define TRISF3                        617
#define TRISF4                        618
#define TRISF5                        619
#define TRISF6                        620
#define TRISF7                        621
#define TRISG                         622
#define TRISG0                        623
#define TRISG1                        624
#define TRISG2                        625
#define TRISG3                        626
#define TRISG4                        627
#define CCPR3L                        628
#define CCPR3H                        629
#define CCP3CON                       630
#define CCP3M                         631
#define CCP3M0                        632
#define CCP3M1                        633
#define CCP3M2                        634
#define CCP3M3                        635
#define DC3B                          636
#define DC3B0                         637
#define DC3B1                         638
#define CCPR4L                        639
#define CCPR4H                        640
#define CCP4CON                       641
#define CCP4M                         642
#define CCP4M0                        643
#define CCP4M1                        644
#define CCP4M2                        645
#define CCP4M3                        646
#define DC4B0                         647
#define DC4B                          648
#define DC4B1                         649
#define CCPR5L                        650
#define CCPR5H                        651
#define CCP5CON                       652
#define CCP5M0                        653
#define CCP5M                         654
#define CCP5M1                        655
#define CCP5M2                        656
#define CCP5M3                        657
#define DC5B0                         658
#define DC5B                          659
#define DC5B1                         660
#define LATF                          661
#define LATF0                         662
#define LATF1                         663
#define LATF2                         664
#define LATF3                         665
#define LATF4                         666
#define LATF5                         667
#define LATF6                         668
#define LATF7                         669
#define LATG                          670
#define LATG0                         671
#define LATG1                         672
#define LATG2                         673
#define LATG3                         674
#define LATG4                         675
#define IOCBP                         676
#define IOCBP0                        677
#define IOCBP1                        678
#define IOCBP2                        679
#define IOCBP3                        680
#define IOCBP4                        681
#define IOCBP5                        682
#define IOCBP6                        683
#define IOCBP7                        684
#define IOCBN0                        685
#define IOCBN                         686
#define IOCBN1                        687
#define IOCBN2                        688
#define IOCBN3                        689
#define IOCBN4                        690
#define IOCBN5                        691
#define IOCBN6                        692
#define IOCBN7                        693
#define IOCBF0                        694
#define IOCBF                         695
#define IOCBF1                        696
#define IOCBF2                        697
#define IOCBF3                        698
#define IOCBF4                        699
#define IOCBF5                        700
#define IOCBF6                        701
#define IOCBF7                        702
#define ANSELF                        703
#define ANSF0                         704
#define ANSF1                         705
#define ANSF2                         706
#define ANSF3                         707
#define ANSF4                         708
#define ANSF5                         709
#define ANSF6                         710
#define ANSF7                         711
#define ANSELG                        712
#define ANSG1                         713
#define ANSG2                         714
#define ANSG3                         715
#define ANSG4                         716
#define TMR3L                         717
#define TMR3H                         718
#define T3CON                         719
#define TMR3ON                        720
#define nT3SYNC                       721
#define T3OSCEN                       722
#define T3CON_SOSCEN                  723
#define T3CKPS                        724
#define T3CKPS0                       725
#define T3CKPS1                       726
#define TMR3CS0                       727
#define TMR3CS                        728
#define TMR3CS1                       729
#define T3GCON                        730
#define T3GSS0                        731
#define T3GSS                         732
#define T3GSS1                        733
#define T3GVAL                        734
#define T3GGO_nDONE                   735
#define T3GSPM                        736
#define T3GTM                         737
#define T3GPOL                        738
#define TMR3GE                        739
#define TMR4                          740
#define PR4                           741
#define T4CON                         742
#define T4CKPS0                       743
#define T4CKPS                        744
#define T4CKPS1                       745
#define TMR4ON                        746
#define T4OUTPS                       747
#define T4OUTPS0                      748
#define T4OUTPS1                      749
#define T4OUTPS2                      750
#define T4OUTPS3                      751
#define TMR5L                         752
#define TMR5H                         753
#define T5CON                         754
#define TMR5ON                        755
#define nT5SYNC                       756
#define T5OSCEN                       757
#define T5CON_SOSCEN                  758
#define T5CKPS                        759
#define T5CKPS0                       760
#define T5CKPS1                       761
#define TMR5CS0                       762
#define TMR5CS                        763
#define TMR5CS1                       764
#define T5GCON                        765
#define T5GSS                         766
#define T5GSS0                        767
#define T5GSS1                        768
#define T5GVAL                        769
#define T5GGO_nDONE                   770
#define T5GSPM                        771
#define T5GTM                         772
#define T5GPOL                        773
#define TMR5GE                        774
#define TMR6                          775
#define PR6                           776
#define T6CON                         777
#define T6CKPS0                       778
#define T6CKPS                        779
#define T6CKPS1                       780
#define TMR6ON                        781
#define T6OUTPS0                      782
#define T6OUTPS                       783
#define T6OUTPS1                      784
#define T6OUTPS2                      785
#define T6OUTPS3                      786
#define WPUG                          787
#define WPUG5                         788
#define RC2REG                        789
#define TX2REG                        790
#define SP2BRGL                       791
#define SP2BRGH                       792
#define RC2STA                        793
#define RC2STA_RX9D                   794
#define RC2STA_OERR                   795
#define RC2STA_FERR                   796
#define RC2STA_ADDEN                  797
#define RC2STA_CREN                   798
#define RC2STA_SREN                   799
#define RC2STA_RX9                    800
#define RC2STA_SPEN                   801
#define TX2STA                        802
#define TX2STA_TX9D                   803
#define TX2STA_TRMT                   804
#define TX2STA_BRGH                   805
#define TX2STA_SENDB                  806
#define TX2STA_SYNC                   807
#define TX2STA_TXEN                   808
#define TX2STA_TX9                    809
#define TX2STA_CSRC                   810
#define BAUD2CON                      811
#define BAUD2CON_ABDEN                812
#define BAUD2CON_WUE                  813
#define BAUD2CON_BRG16                814
#define BAUD2CON_SCKP                 815
#define BAUD2CON_RCIDL                816
#define BAUD2CON_ABDOVF               817
#define TMR8                          818
#define PR8                           819
#define T8CON                         820
#define T8CKPS0                       821
#define T8CKPS                        822
#define T8CKPS1                       823
#define TMR8ON                        824
#define T8OUTPS                       825
#define T8OUTPS0                      826
#define T8OUTPS1                      827
#define T8OUTPS2                      828
#define T8OUTPS3                      829
#define TMR10                         830
#define PR10                          831
#define T10CON                        832
#define T10CKPS                       833
#define T10CKPS0                      834
#define T10CKPS1                      835
#define TMR10ON                       836
#define T10OUTPS0                     837
#define T10OUTPS                      838
#define T10OUTPS1                     839
#define T10OUTPS2                     840
#define T10OUTPS3                     841
#define CCPR6L                        842
#define CCPR6H                        843
#define CCP6CON                       844
#define CCP6M                         845
#define CCP6M0                        846
#define CCP6M1                        847
#define CCP6M2                        848
#define CCP6M3                        849
#define DC6B0                         850
#define DC6B                          851
#define DC6B1                         852
#define CCPR7L                        853
#define CCPR7H                        854
#define CCP7CON                       855
#define CCP7M0                        856
#define CCP7M                         857
#define CCP7M1                        858
#define CCP7M2                        859
#define CCP7M3                        860
#define DC7B                          861
#define DC7B0                         862
#define DC7B1                         863
#define CCPR8L                        864
#define CCPR8H                        865
#define CCP8CON                       866
#define CCP8M0                        867
#define CCP8M                         868
#define CCP8M1                        869
#define CCP8M2                        870
#define CCP8M3                        871
#define DC8B0                         872
#define DC8B                          873
#define DC8B1                         874
#define CCPR9L                        875
#define CCPR9H                        876
#define CCP9CON                       877
#define CCP9M0                        878
#define CCP9M                         879
#define CCP9M1                        880
#define CCP9M2                        881
#define CCP9M3                        882
#define DC9B0                         883
#define DC9B                          884
#define DC9B1                         885
#define CCPR10L                       886
#define CCPR10H                       887
#define CCP10CON                      888
#define CCP10M                        889
#define CCP10M0                       890
#define CCP10M1                       891
#define CCP10M2                       892
#define CCP10M3                       893
#define DC10B0                        894
#define DC10B                         895
#define DC10B1                        896
#define STATUS_SHAD                   897
#define C_SHAD                        898
#define DC_SHAD                       899
#define Z_SHAD                        900
#define WREG_SHAD                     901
#define BSR_SHAD                      902
#define PCLATH_SHAD                   903
#define FSR0L_SHAD                    904
#define FSR0H_SHAD                    905
#define FSR1L_SHAD                    906
#define FSR1H_SHAD                    907
#define STKPTR                        908
#define TOSL                          909
#define TOSH                          910

#endif // _PIC16LF1527_H_
